Capstone-Tuk-FireDetection/esp32-cam/app_httpd.cpp
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// 사용자는 이 파일을 라이선스 조건에 맞게 사용할 수 있습니다.
// 라이선스 전문은 아래 URL에서 확인할 수 있습니다.
//     http://www.apache.org/licenses/LICENSE-2.0
//
// 법률에 의해 요구되거나 서면으로 합의되지 않는 한, 소프트웨어는 "있는 그대로" 제공되며,
// 어떠한 보증도 제공되지 않습니다.

#include "esp_http_server.h"    // HTTP 서버 기능 제공
#include "esp_timer.h"          // 시간 관련 함수 제공
#include "esp_camera.h"         // ESP32 카메라 기능 제공
#include "img_converters.h"     // 이미지 변환 함수 제공 (예, JPEG, BMP 변환)
#include "fb_gfx.h"             // 프레임버퍼 그래픽 처리 함수 제공
#include "esp32-hal-ledc.h"      // LED PWM 제어 기능 제공
#include "sdkconfig.h"          // SDK 설정 관련 헤더
#include "camera_index.h"       // 웹 서버용 HTML 인덱스 페이지 데이터 포함

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"      // ESP32 Arduino 로그 함수 제공 (정보 출력)
#endif

// LED FLASH 기능을 활성화 (0: 비활성, 1: 활성)
#define CONFIG_LED_ILLUMINATOR_ENABLED 1

// LED FLASH 관련 설정 (LED 사용이 활성화 되었을 때)
#if CONFIG_LED_ILLUMINATOR_ENABLED
#define LED_LEDC_GPIO            22      // LED 연결된 GPIO 핀
#define CONFIG_LED_MAX_INTENSITY 255     // LED 최대 밝기 값

int led_duty = 0;      // 현재 LED 밝기 duty 값
bool isStreaming = false;  // 스트리밍 중인지 여부
#endif

// HTTP 응답을 위한 JPEG 청크 정보를 저장하는 구조체
typedef struct {
  httpd_req_t *req;  // HTTP 요청 핸들
  size_t len;        // 전송한 데이터 길이
} jpg_chunking_t;

// 스트림용 경계(boundary) 문자열과 콘텐츠 타입 등 설정
#define PART_BOUNDARY "123456789000000000000987654321"
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\nX-Timestamp: %d.%06d\r\n\r\n";

// HTTP 서버 핸들러 변수
httpd_handle_t stream_httpd = NULL;   // 스트림 서버
httpd_handle_t camera_httpd = NULL;   // 카메라 제어 서버

// 값 필터링을 위한 구조체 (프레임 간 시간 평균 계산 등에 사용)
typedef struct {
  size_t size;    // 필터에 사용할 샘플 개수
  size_t index;   // 현재 샘플 인덱스
  size_t count;   // 실제 입력된 샘플 수
  int sum;        // 샘플 합계
  int *values;    // 샘플 값을 저장할 배열
} ra_filter_t;

static ra_filter_t ra_filter;   // 전역 필터 변수

// 필터 초기화 함수: sample_size 만큼의 배열을 할당하고 0으로 초기화
static ra_filter_t *ra_filter_init(ra_filter_t *filter, size_t sample_size) {
  memset(filter, 0, sizeof(ra_filter_t));
  filter->values = (int *)malloc(sample_size * sizeof(int));
  if (!filter->values) {
    return NULL;
  }
  memset(filter->values, 0, sample_size * sizeof(int));
  filter->size = sample_size;
  return filter;
}

#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
// 필터를 이용해 새 값(value)을 추가하고 평균값을 계산한다.
static int ra_filter_run(ra_filter_t *filter, int value) {
  if (!filter->values) {
    return value;
  }
  // 이전 값 제거
  filter->sum -= filter->values[filter->index];
  // 현재 인덱스에 새 값 저장
  filter->values[filter->index] = value;
  // 합계 업데이트
  filter->sum += filter->values[filter->index];
  // 인덱스 증가 및 배열 크기만큼 모듈로 연산
  filter->index++;
  filter->index = filter->index % filter->size;
  // 입력된 샘플 개수 업데이트
  if (filter->count < filter->size) {
    filter->count++;
  }
  // 평균값 반환
  return filter->sum / filter->count;
}
#endif

#if CONFIG_LED_ILLUMINATOR_ENABLED
// LED를 켜거나 끄는 함수
void enable_led(bool en) {
  int duty = en ? led_duty : 0;   // LED 켜면 현재 설정값, 끄면 0
  // 스트리밍 중이면 최대 밝기 제한 적용
  if (en && isStreaming && (led_duty > CONFIG_LED_MAX_INTENSITY)) {
    duty = CONFIG_LED_MAX_INTENSITY;
  }
  // LED PWM duty 값을 설정하여 밝기 제어
  ledcWrite(LED_LEDC_GPIO, duty);
  // (다른 LEDC 설정 함수들도 주석 처리되어 있음)
  log_i("Set LED intensity to %d", duty);
}
#endif

// BMP 포맷 이미지를 HTTP 응답으로 전송하는 핸들러 함수
static esp_err_t bmp_handler(httpd_req_t *req) {
  camera_fb_t *fb = NULL;
  esp_err_t res = ESP_OK;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  uint64_t fr_start = esp_timer_get_time();   // 처리 시작 시간 기록
#endif
  // 카메라에서 프레임 버퍼 캡처
  fb = esp_camera_fb_get();
  if (!fb) {
    log_e("Camera capture failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }
  // HTTP 응답 타입 및 헤더 설정
  httpd_resp_set_type(req, "image/x-windows-bmp");
  httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.bmp");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  // 타임스탬프 헤더 설정
  char ts[32];
  snprintf(ts, 32, "%lld.%06ld", fb->timestamp.tv_sec, fb->timestamp.tv_usec);
  httpd_resp_set_hdr(req, "X-Timestamp", (const char *)ts);

  // BMP 포맷으로 변환
  uint8_t *buf = NULL;
  size_t buf_len = 0;
  bool converted = frame2bmp(fb, &buf, &buf_len);
  esp_camera_fb_return(fb);
  if (!converted) {
    log_e("BMP Conversion failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }
  // 변환된 이미지 데이터를 HTTP 응답으로 전송
  res = httpd_resp_send(req, (const char *)buf, buf_len);
  free(buf);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  uint64_t fr_end = esp_timer_get_time();   // 처리 종료 시간 기록
#endif
  log_i("BMP: %llums, %uB", (uint64_t)((fr_end - fr_start) / 1000), buf_len);
  return res;
}

// JPEG 인코딩 시 콜백 함수: 인코딩된 데이터를 HTTP 청크 응답으로 전송
static size_t jpg_encode_stream(void *arg, size_t index, const void *data, size_t len) {
  jpg_chunking_t *j = (jpg_chunking_t *)arg;
  if (!index) {
    j->len = 0;
  }
  if (httpd_resp_send_chunk(j->req, (const char *)data, len) != ESP_OK) {
    return 0;
  }
  j->len += len;
  return len;
}

// 단일 캡처(정지된 이미지)를 처리하여 JPEG 이미지로 HTTP 응답 전송하는 핸들러
static esp_err_t capture_handler(httpd_req_t *req) {
  camera_fb_t *fb = NULL;
  esp_err_t res = ESP_OK;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  int64_t fr_start = esp_timer_get_time();
#endif

#if CONFIG_LED_ILLUMINATOR_ENABLED
  // LED를 켜서 밝기를 높여 캡처 효과 개선
  enable_led(true);
  // LED가 켜진 후 충분히 밝아질 때까지 대기 (~150ms)
  vTaskDelay(150 / portTICK_PERIOD_MS);
  fb = esp_camera_fb_get();  // 캡처된 프레임 가져오기
  enable_led(false);         // 캡처 후 LED 끄기
#else
  fb = esp_camera_fb_get();  // LED 기능 없으면 바로 프레임 캡처
#endif

  if (!fb) {
    log_e("Camera capture failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  // HTTP 응답 헤더 설정 (JPEG 이미지)
  httpd_resp_set_type(req, "image/jpeg");
  httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.jpg");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  // 타임스탬프 헤더 설정
  char ts[32];
  snprintf(ts, 32, "%lld.%06ld", fb->timestamp.tv_sec, fb->timestamp.tv_usec);
  httpd_resp_set_hdr(req, "X-Timestamp", (const char *)ts);

#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  size_t fb_len = 0;
#endif
  // 만약 프레임 포맷이 JPEG이면 그대로 전송
  if (fb->format == PIXFORMAT_JPEG) {
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    fb_len = fb->len;
#endif
    res = httpd_resp_send(req, (const char *)fb->buf, fb->len);
  } else {
    // JPEG가 아니라면 JPEG 인코딩 후 청크 전송
    jpg_chunking_t jchunk = {req, 0};
    res = frame2jpg_cb(fb, 80, jpg_encode_stream, &jchunk) ? ESP_OK : ESP_FAIL;
    // 전송 종료 청크 전송
    httpd_resp_send_chunk(req, NULL, 0);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    fb_len = jchunk.len;
#endif
  }
  esp_camera_fb_return(fb);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  int64_t fr_end = esp_timer_get_time();
#endif
  log_i("JPG: %uB %ums", (uint32_t)(fb_len), (uint32_t)((fr_end - fr_start) / 1000));
  return res;
}

// 연속 스트리밍 모드에서 캡처한 프레임들을 HTTP 멀티파트 스트림으로 전송하는 핸들러
static esp_err_t stream_handler(httpd_req_t *req) {
  camera_fb_t *fb = NULL;
  struct timeval _timestamp;
  esp_err_t res = ESP_OK;
  size_t _jpg_buf_len = 0;
  uint8_t *_jpg_buf = NULL;
  char *part_buf[128];

